In [57]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
import matplotlib
matplotlib.rcParams["figure.figsize"] = (20,10)

In [58]:
df1=pd.read_csv("chennai_property_price.csv")
df1.head()

,price,area,status,bhk,bathroom,age,location,builder
0,37.49,872,Ready to move,2,NaN,1.0,Sembakkam,MP Developers
1,93.54,1346,Under Construction,3,2.0,NaN,Selaiyur,DAC Promoters
2,151.00,2225,Under Construction,3,NaN,0.0,Mogappair,Casagrand Builder Private Limited
3,49.00,1028,Ready to move,2,2.0,3.0,Ambattur,Dugar Housing Builders
4,42.28,588,Under Construction,2,1.0,0.0,Pallavaram,Radiance Realty Developers India Ltd

In [59]:
df1.shape()

TypeError: 'tuple' object is not callable

In [60]:
df1.groupby('location')['location'].agg('count')

location
Adambakam         8
Adyar            11
Agaramthen        7
Alandur           5
Alwarpet         11
                 ..
Virugambakkam     8
Washermanpet      1
West Mambalam    47
West Tambaram     7
tambaram west    14
Name: location, Length: 178, dtype: int64

In [61]:
df2=df1.drop(['status','builder','age'],axis='columns')
df2.head()

    price  area  bhk  bathroom    location
0   37.49   872    2       NaN   Sembakkam
1   93.54  1346    3       2.0    Selaiyur
2  151.00  2225    3       NaN   Mogappair
3   49.00  1028    2       2.0    Ambattur
4   42.28   588    2       1.0  Pallavaram

In [62]:
df2.isnull().sum()

price          0
area           0
bhk            0
bathroom    1217
location       0
dtype: int64

In [63]:
df3=df3.fillna(df3.median())

C:\Users\jiite\AppData\Local\Temp/ipykernel_16352/2322390511.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df3=df3.fillna(df3.median())

In [64]:
df3.isnull().sum()

price       0
area        0
bhk         0
bathroom    0
location    0
dtype: int64

In [65]:
df3['bhk'].unique()

array([2, 3, 4, 1, 5, 6, 8], dtype=int64)

In [66]:
df3[df3.price>20]

       price  area  bhk  bathroom     location
0      37.49   872    2       2.0    Sembakkam
1      93.54  1346    3       2.0     Selaiyur
2     151.00  2225    3       2.0    Mogappair
3      49.00  1028    2       2.0     Ambattur
4      42.28   588    2       1.0   Pallavaram
...      ...   ...  ...       ...          ...
2615   27.50   750    2       2.0  Veppampattu
2616   27.50   750    2       2.0  Veppampattu
2617   30.00   800    2       2.0  Veppampattu
2618   31.50   850    2       2.0  Veppampattu
2619   34.00   900    2       2.0  Veppampattu

[2582 rows x 5 columns]

In [67]:
df3.area.unique()

array([ 872, 1346, 2225, ..., 1127, 1131,  898], dtype=int64)

In [68]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [69]:
df3[~df3['area'].apply(is_float)].head()

Empty DataFrame
Columns: [price, area, bhk, bathroom, location]
Index: []

In [70]:
def convert_sqft_to_num(x):
    tokens=x.split('-')
    if len(tokens) == 2:
        return (float(tokens[0])+float(tokens[1]))/2
    try:
        return float(x)
    except:
        return None

In [71]:
convert_sqft_to_num('2160-2189')

2174.5

In [72]:
df4=df3.copy()
df4['area']=df4['area'].apply(is_float)
df4.head()

    price  area  bhk  bathroom    location
0   37.49  True    2       2.0   Sembakkam
1   93.54  True    3       2.0    Selaiyur
2  151.00  True    3       2.0   Mogappair
3   49.00  True    2       2.0    Ambattur
4   42.28  True    2       1.0  Pallavaram

In [73]:
df5=df3.copy()
df5['price_per_sqft']=df5['price']*100000/df5['area']
df5.head()

    price  area  bhk  bathroom    location  price_per_sqft
0   37.49   872    2       2.0   Sembakkam     4299.311927
1   93.54  1346    3       2.0    Selaiyur     6949.479941
2  151.00  2225    3       2.0   Mogappair     6786.516854
3   49.00  1028    2       2.0    Ambattur     4766.536965
4   42.28   588    2       1.0  Pallavaram     7190.476190

In [74]:
len(df5.location.unique())

178

In [78]:
df5.location=df5.location.apply(lambda x: x.strip())


location_stats=df5.groupby('location')['location'].agg('count').sort_values(ascending=False)
location_stats

location
Veppampattu                       149
Pammal                            139
Medavakkam                        111
Sholinganallur                     99
Perungudi                          88
                                 ...
Red Hills                           1
Padapai                             1
Oragadam Village Ambattur Talu      1
Thiruvidandhai                      1
Padi                                1
Name: location, Length: 178, dtype: int64